### 숫자 자료형
# 수에는 1, 2, 3 과 같은 정수도 있고 1.0, 3.14와 같은 실수도 있습니다. 이러한 형태의 자료를 숫자 자료형이라고함
# 우리가 알고 있는대로 그대로 사용하면 됨.

# print(5)    # 5 출력
# 이 소스코드에서 print()는 괄호사이에 있는 값을 출력하는 역할을 수행합니다. 그래서 실행해보면 우리가 입력한 5가 Terminal에 출력

# 코드를 조금 더 적어보겠습니다.

"""
print(-10)    # -10 출력
print(3.14)    # 3.14 출력
print(1000)    # 1000 출력
"""
# 실행을 시켜보면 음수인 -10, 실수인 3.14, 그리고 조금 큰 수인 1000도 잘 출력 되는 걸 알 수 있음.


# 지금까지는 하나의 수에 대해서만 출력했는데 간단한 연산도 할 수 있습니다.
"""
print(5 + 3)    # 8 출력
print(2 * 8)    # 16 출력
print(3 * (3 + 1))    # 12 출력
"""
